app/views/users/_acceptfriend.html.erb

<%= form_for(current_user.friendships.find_by(friend_id: locals[:friend][:id]),
             html: { method: :patch }) do |f| %>
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]