app/views/users/show.html.erb

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 2]]
---
      				</section>
			    <% if @user.posts.any? %>