app/views/posts/_post.html.erb

SELECT "posts".* FROM "posts" WHERE (user_id IN (SELECT friend_id FROM friendships where user_id = 2) OR user_id = 2) ORDER BY "posts"."created_at" DESC
---
    <% end %>
    <% if current_user.liked_posts.find_by(:post_id => post.id).nil?%>