app/controllers/friendships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["status", "requested"], ["created_at", 2016-08-08 12:56:24 UTC], ["updated_at", 2016-08-08 12:56:24 UTC]]
---
	def create
		@user = current_user
		@friend = User.find(params[:friend_id])
		@friendship1 = Friendship.new(:user => @user, :friend => @friend, :status => 'requested')
		@friendship2 = Friendship.new(:user => @friend, :friend => @user, :status => 'pending')
		if @friendship1.save! && @friendship2.save!

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 AND "friendships"."status" = $3 AND "friendships"."id" = $4 LIMIT $5  [["user_id", 1], ["friend_id", 2], ["status", "pending"], ["id", nil], ["LIMIT", 1]]
UPDATE "friendships" SET "status" = 'accepted' WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 AND "friendships"."status" = $3  [["user_id", 1], ["friend_id", 2], ["status", "pending"]]
---
	def update
		@user = current_user
		@friend = Friendship.find(params[:id]).friend
		@friendship1 = Friendship.where(user_id: @user.id, friend_id: @friend.id, status: "pending")
		@friendship2 = Friendship.where(user_id: @friend.id, friend_id: @user.id, status: "requested")
		if @friendship1.update_all(:status => "accepted") && @friendship2.update_all(:status => "accepted")

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2  [["user_id", 3], ["friend_id", 4]]
---
	def destroy
		@user = current_user
		@friend = Friendship.find(params[:id]).friend
		@friendship1 = Friendship.where(user_id: @user.id, friend_id: @friend.id).delete_all