app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)
		if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "jeden dwa trzy"], ["user_id", 2], ["created_at", 2016-08-09 12:48:05 UTC], ["updated_at", 2016-08-09 12:48:05 UTC]]