app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id IN (SELECT friend_id FROM friendships where user_id = 2) OR user_id = 2) ORDER BY "posts"."created_at" DESC
---
	def show
		@user = User.find(params[:id])
		@posts = Post.where('user_id IN (SELECT friend_id FROM friendships where user_id = ?) OR user_id = ?', current_user.id, current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def index
		@users = User.where('id NOT IN (SELECT friend_id FROM friendships where user_id = ?) AND id != ?', current_user.id, current_user.id)